#+TITLE: Read, Process and Create iCalendar Data and Files
#+AUTHOR: Enrico Schumann

Utilities for handling icalendar data. The package is
written in pure R, with no strict dependencies (package
'base64enc' is only needed if calendar files have
attachments). The package maps iCalendar dates and
date-times to R's native 'Date' and 'POSIXct' classes.
Recurring items can be expanded.  Timezones are
supported.

* Installation

To install the package from a running R session, type:
#+BEGIN_SRC R :eval never
  install.packages('icalutils, type = 'source',
                   repos = c('http://enricoschumann.net/R',
                             getOption('repos')))
#+END_SRC

or clone/build the GitHub version.


* Examples

#+BEGIN_SRC R :results output :exports both :session **R**
  library("icalutils")
  as.data.frame(read_icalendar("/path/to/file"))
#+END_SRC

Computing recurring events (such as birthdays):

#+BEGIN_SRC R :results output :exports both :session **R**
  as.data.frame(read_calendar("/path/to/file"), 
                recur.expand = TRUE,
                recur.until = Sys.Date + 30) ## events in next 30 days
#+END_SRC

Recurrence sets can be computed with function =rrule=.

#+BEGIN_SRC R :results output :exports both :session **R**
  rrule(dtstart = as.Date("2019-12-01"),
	dtend   = as.Date("2019-12-01"),
	freq = "yearly",
	count = 5)
#+END_SRC

#+RESULTS:
#+begin_example
$text
[1] "FREQ=yearly;COUNT=5;INTERVAL=1"

$recurrence_set
     DTSTART      DTEND
1 2019-12-01 2019-12-01
2 2020-12-01 2020-12-01
3 2021-12-01 2021-12-01
4 2022-12-01 2022-12-01
5 2023-12-01 2023-12-01
#+end_example


Setting up a daily email.

#+begin_src R
  library("icalutils")
  library("mailtools")  ## https://github.com/enricoschumann/mailtools 

  file <- "/path/to/file"
  lookahead <- 30

  ic <- read_icalendar(file, components = "VEVENT")

  df <- as.data.frame(ic, 
		      recur.expand = TRUE,
		      recur.until = Sys.Date() + lookahead)
  df <- df[df$start >= as.POSIXct(paste(Sys.Date(), "00:00:00")) &
	   df$start <  as.POSIXct(Sys.Date() + lookahead), ]

  df <- df[order(df$start), ]
  start <- as.Date(df$start, tz = "")
  end <- as.Date(df$end, tz = "")

  dt <- as.character(start)
  ii <- start != end
  dt[ii] <- paste(as.character(start[ii]), "--", as.character(end[ii]))
  dt

  sendmail(subject = "Kalender",
	   body = c("",
		    paste("Calendar entries for the next", lookahead,  "days"),
		    "",
		    "",
		    paste0(substr(format(df$summary, width = 25), 1, 40),
			   "  [", dt, "]"),
		    ""),

	   method   = "sendemail",
	   to       = "<someone@somewhere.net>",
	   from     = "<someone@somewhere.net>",
	   port     = 587,
	   server   = "<server.net>",
	   user     = "<username>",
	   password = "",
	   headers  = "X-MAIL-CATEGORY: daily calendar report")

#+end_src
